
DECLARE @idContract As INT
DECLARE @idPeriod AS INT
DECLARE @Year AS INT
DECLARE @Month AS INT

SET @Year = 2024
SET @Month = 6
SET @idPeriod = (SELECT p.idPeriod FROM  Period p WHERE p.Year = @Year AND p.MONTH = @Month)
     
DECLARE cursC CURSOR LOCAL FAST_FORWARD FOR

SELECT c.IDContract FROM Contract c WHERE c.Account IN (2994043, 1023074)
  --(2771203,2101050,0322028,2498063,1141107,2432184,1141106,3331010,1753041,3151094,3332033,3332030,3332040,2781262,1012029,1712147,1034032,1434078,3681110,2332012,1833105,2124032,3731088,2521095,1935011,2053043,1221006,1221006,1812047,2682012,2141129,2472051,2062058,1952113,3591050,1665052,2664117,1802086)

OPEN cursC
  FETCH NEXT FROM cursC INTO @idContract
  WHILE @@FETCH_STATUS = 0 BEGIN
    -------------------------------------------------------------------------------------
       exec dbo.spRecalcBalances @IDContract, @IDPeriod;
       exec dbo.spRecalcBalancesRealOnePeriodByContract @IDContract, @IDPeriod;
    -------------------------------------------------------------------------------------
  FETCH NEXT FROM cursC INTO @idContract
  END

CLOSE cursC
DEALLOCATE cursC


--select * from BALANCEREAL where IDCONTRACT=860864 and IDPERIOD=233;

/*
Реальный, бухгалтерский баланс -921,33 тенге на начало месяца
+-------------+------------+--------+----------+------------------+-------------------+---------+
|IDBalanceReal|IDAccounting|IDPeriod|IDContract|AmountBalance     |AmountCharge       |AmountPay|
+-------------+------------+--------+----------+------------------+-------------------+---------+
|28000427     |1           |233     |860864    |-921.3397049999961|-137801.08053499996|137104   |
|28000969     |6           |233     |860864    |0                 |-2968              |2968     |
+-------------+------------+--------+----------+------------------+-------------------+---------+

Документ оплаты 1000
+----------+----------+--------+-------+--------------+--------------+-----------------------+--------------+-----+------+-----------------------+--------+-----------------------+----+------------+--------------+------+-----+
|IDDocument|IDContract|IDPeriod|IDBatch|IDTypeDocument|DocumentNumber|DocumentDate           |DocumentAmount|IDGru|IdUser|DateAdd                |IdModify|DateModify             |Note|TerminalData|IDTypeDocument|Name  |Level|
+----------+----------+--------+-------+--------------+--------------+-----------------------+--------------+-----+------+-----------------------+--------+-----------------------+----+------------+--------------+------+-----+
|24566724  |860864    |233     |97270  |1             |4877          |2024-06-13 00:00:00.000|1000          |NULL |58    |2024-06-17 00:00:00.000|58      |2024-06-17 09:13:04.360|NULL|NULL        |1             |Оплата|0    |
+----------+----------+--------+-------+--------------+--------------+-----------------------+--------------+-----+------+-----------------------+--------+-----------------------+----+------------+--------------+------+-----+

Операция которая изменяет баланс 28201758 по документу 24566724
+-----------+-----------------------+---------------+---------------+---------+----------+---------------+-----------+-------------+------------+
|IDOperation|DateOperation          |AmountOperation|NumberOperation|IDBalance|IDDocument|IdTypeOperation|№ документа|Тип документа|Тип операции|
+-----------+-----------------------+---------------+---------------+---------+----------+---------------+-----------+-------------+------------+
|26258188   |2024-06-13 00:00:00.000|1000           |0              |28201758 |24566724  |1              |4877       |Оплата       |Оплата      |
+-----------+-----------------------+---------------+---------------+---------+----------+---------------+-----------+-------------+------------+

Текущий баланс -921,33 + 1000 = 78,66 (+ переплата)
+---------+------------+--------+----------+-------------+-------------------+---------+
|IDBalance|IDAccounting|IDPeriod|IDContract|AmountBalance|AmountCharge       |AmountPay|
+---------+------------+--------+----------+-------------+-------------------+---------+
|28201758 |1           |233     |860864    |78.660295    |-137801.08053499996|138104   |
|28202438 |6           |233     |860864    |0            |-2968              |2968     |
+---------+------------+--------+----------+-------------+-------------------+---------+

Если нам необходимо скорректировать бухгалтерский баланс, то запускаем пересчет остатков:
И реальный баланс выравнивается по текущему.

AmountPay был 137104, оплата прошла 1000 = 138104
+-------------+------------+--------+----------+-------------+------------+---------+
|IDBalanceReal|IDAccounting|IDPeriod|IDContract|AmountBalance|AmountCharge|AmountPay|
+-------------+------------+--------+----------+-------------+------------+---------+
|28169324     |1           |233     |860864    |78.66        |-137801.081 |138104   |
|28169325     |6           |233     |860864    |0            |-2968       |2968     |
+-------------+------------+--------+----------+-------------+------------+---------+

!!! Обычно, при проведении документов, Реальный баланс не пересчитывается, т.к. это обновит остаток на начало месяца.

 */