
------------------------------------------------------------------------------------------------------------------------
--
--
--
------------------------------------------------------------------------------------------------------------------------






------------------------------------------------------------------------------------------------------------------------
-- 29 июня 2023
-- Оптимизация таблицы AUTODOCUMENT
-- Очистка, создание индекса (idautobatch, number, IDAutoDocument)
------------------------------------------------------------------------------------------------------------------------
select 'Всего', count(*)
from AUTODOCUMENT

union all

select 'не 2023', count(*)
from AUTODOCUMENT
where Year(DOCUMENTDATE)<>2023;

select Year(DOCUMENTDATE), count(*)
from AUTODOCUMENT
group by Year(DOCUMENTDATE);
+----+------+
|    |      |
+----+------+
|2015|217853|
|2016|254816|
|2017|277711|
|2018|181234|
|2019|480086|
|2020|501232|
|2021|515496|
|2022|530483|
|2023|265772|
|2026|1     |
+----+------+

+-------+-------+
|       |       |
+-------+-------+
|Всего  |3224684|
|не 2023|2958912|
+-------+-------+

--delete from AUTODOCUMENT where Year(DOCUMENTDATE)<>2023;

CREATE INDEX IX_AutoDocument_IdBatch_Number_IDAutoDocument
ON AutoDocument (idautobatch, number, IDAutoDocument);

--DROP INDEX IX_AutoDocument_IdBatch_Number_IDAutoDocument ON AutoDocument;
------------------------------------------------------------------------------------------------------------------------